#include <iostream>
#include <locale.h>
#include <stdio.h>
#include <time.h>
#include <chrono>
#include <thread>
//3
void task1()
{
	int a, n, k = 0;
	

	printf("Введите кол-во товаров = ");
	scanf_s("%d", &n);

	for (size_t i = 0; i < n; i++)
	{
	
		printf("Введите стоимость товара > 1000 = \n");
		scanf_s("%d", &a);
		if (a > 1000)
		{
		
			k += a;
		}
		else if (a <= 1000)
		{

			printf("Ошибка. Стоимость товара должна превышать 1000\n", k);
			printf("Начните сначала задания\n", k);

		}
	}
	printf("стоимость товаров > 1000 = %d\n", k);
}
//4
void task2()
{
	int a, b, n;
	printf("Введите кол-во журналов = ");
	scanf_s("%d", &a);
	b = 20 + rand() % 100;
	if (a > 1)
	{
		n = a * b;
		printf("Кол-во журналов = %d\n", a);
		printf("Кол-во страниц в 1 журнале= %d\n", b);
		printf("Кол-во страниц в общем = %d\n", n);
	}


}
//5
void task3()
{
	int c1, c2, c3, c4, c5, c6, c7, c8, c9, c10, c11;
	int a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11;
	int b1, b2, b3, b4, b5, b6, b7, b8, b9, b10, b11;
	int totalO, totalc, totala, totalb;

	c1 = 5 + rand() % 20;
	c2 = 5 + rand() % 20;
	c3 = 5 + rand() % 20;
	c4 = 5 + rand() % 20;
	c5 = 5 + rand() % 20;
	c6 = 5 + rand() % 20;
	c7 = 5 + rand() % 20;
	c8 = 5 + rand() % 20;
	c9 = 5 + rand() % 20;
	c10 = 5 + rand() % 20;
	c11 = 5 + rand() % 20;

	a1 = 5 + rand() % 20;
	a2 = 5 + rand() % 20;
	a3 = 5 + rand() % 20;
	a4 = 5 + rand() % 20;
	a5 = 5 + rand() % 20;
	a6 = 5 + rand() % 20;
	a7 = 5 + rand() % 20;
	a8 = 5 + rand() % 20;
	a9 = 5 + rand() % 20;
	a10 = 5 + rand() % 20;
	a11 = 5 + rand() % 20;

	b1 = 5 + rand() % 20;
	b2 = 5 + rand() % 20;
	b3 = 5 + rand() % 20;
	b4 = 5 + rand() % 20;
	b5 = 5 + rand() % 20;
	b6 = 5 + rand() % 20;
	b7 = 5 + rand() % 20;
	b8 = 5 + rand() % 20;
	b9 = 5 + rand() % 20;
	b10 = 5 + rand() % 20;
	b11 = 5 + rand() % 20;

	totala = a1 + a2 + a3 + a4 + a5 + a6 + a7 + a8 + a9 + a10 + a11;
	printf("--------------------------------------------------------------------------\n");
	printf("В каждом (А) классе с 1 по 11\n");
	printf("(1 = %d), (2 = %d), (3 = %d), (4 = %d), (5 = %d),\n", a1, a2, a3, a4, a5);
	printf("(6 = %d), (7 = %d), (8 = %d), (9 = %d), (10 = %d), (11 = %d)\n", a6, a7, a8, a9, a10, a11);
	printf("--------------------------------------------------------------------------\n");
	printf("В (А) классе с 1 по 11 класс человек = %d\n", totala);
	printf("--------------------------------------------------------------------------\n");

	totalc = c1 + c2 + c3 + c4 + c5 + c6 + c7 + c8 + c9 + c10 + c11;
	printf("--------------------------------------------------------------------------\n");
	printf("В каждом (C) классе с 1 по 11\n");
	printf("(1 = %d), (2 = %d), (3 = %d), (4 = %d), (5 = %d),\n", c1, c2, c3, c4, c5);
	printf("(6 = %d), (7 = %d), (8 = %d), (9 = %d), (10 = %d), (11 = %d)\n", c6, c7, c8, c9, c10, c11);
	printf("--------------------------------------------------------------------------\n");
	printf("В (C) классе с 1 по 11 класс человек = %d\n", totalc);
	printf("--------------------------------------------------------------------------\n");

	totalb = b1 + b2 + b3 + b4 + b5 + b6 + b7 + b8 + b9 + b10 + b11;
	printf("--------------------------------------------------------------------------\n");
	printf("В каждом (B) классе с 1 по 11\n");
	printf("(1 = %d), (2 = %d), (3 = %d), (4 = %d), (5 = %d),\n", b1, b2, b3, b4, b5);
	printf("(6 = %d), (7 = %d), (8 = %d), (9 = %d), (10 = %d), (11 = %d)\n", b6, b7, b8, b9, b10, b11);
	printf("--------------------------------------------------------------------------\n");
	printf("В (B) классе с 1 по 11 класс человек = %d\n", totalb);
	printf("--------------------------------------------------------------------------\n");
	totalO = totala + totalc + totalb;
	printf("--------------------------------------------------------------------------\n");
	printf("Во всех классах с 1 по 11 класс, в (А),(B),(C) человек = %d\n", totalO);
	printf("--------------------------------------------------------------------------\n");
}
//6
void task4()
{
	int a, b, n;
	printf("Введите кол-во людей от 50 до 100 = \n");
	scanf_s("%d", &a);
	if (a < 50)
	{
		printf("Ошибка, введите кол-во людей от 50 до 100\n");
	}
	else if (a > 50)
	{
		b = rand() % 50;

		n = a - b;
		printf("Людей родившився после 1990 = %d\n", n);
		printf("Людей родившився до 1985 = %d\n", b);
	}

}
//7
void task5()
{
	int a, b, n;
	printf("Введите кол-во команд от 50 до 100 = \n");
	scanf_s("%d", &a);
	if (a < 50)
	{
		printf("Ошибка, введите кол-во команд от 50 до 100\n");
	}
	else if (a > 50)
	{
		b = rand() % 50;

		n = a - b;
		printf("команд больше выигрешей = %d\n", n);
		printf("команд больше проигрешей = %d\n", b);
	}

}







int main()
{
	srand(time(NULL) + rand());
	setlocale(LC_ALL, "");
	int task = 0;
	int restart = 0;

	do
	{
		printf("-------------------------------------------------------------------------------\n");
		printf("Введите номер задания\n");
		printf("-------------------------------------------------------------------------------\n");
		printf("1 - Найти общую стоимость тех товаров, которые стоят дороже 1000 тенге\n");
		printf("-------------------------------------------------------------------------------\n");
		printf("2 - Найти общее число страниц во всех журналах\n");
		printf("-------------------------------------------------------------------------------\n");
		printf("3 - Определить общее число детей, \n");
		printf("-------------------------------------------------------------------------------\n");
		printf("4 - Определить число людей, родившихся до 1985 и  после 1990 года\n");
		printf("-------------------------------------------------------------------------------\n");
		printf("5 - Определить, сколько команд имеют больше выигрышей, чем проигрышей\n");
		scanf_s("%d", &task);

		switch (task)
		{
		case 1:
		{
			task1();
		}break;
		case 2:
		{
			task2();
		case 3:
		{
			task3();
		}break;
		case 4:
		{
			task4();
		}break;
		case 5:
		{
			task5();
		}break;
		}break;
		}
		

		printf("-------------------------------------------------------------------------------\n");
		printf("Хотите продолжить 1/0\n");
		printf("-------------------------------------------------------------------------------\n");
		scanf_s("%d", &restart);
	} while (restart = 1);

}